
{
  "recipe_title": "Spinach and Artichoke Pan Pizza",
  "recipe_slug": "spinach-and-artichoke-pan-pizza",
  "category_name": "Pizza",
  "source_title": "Smitten Kitchen",
  "author_name": "Deb Perelman",
  "special_equipment": [
    "12-inch cast-iron skillet or 9x13-inch cake pan",
    "food processor or high-speed blender",
    "mixing bowl",
    "spoon or dough whisk",
    "plastic wrap"
  ],
  "ingredients": [
    "2 cups (260 grams) all-purpose flour",
    "1 teaspoon instant yeast",
    "1 teaspoon kosher salt (Diamond Crystal; use half for other brands)",
    "1 cup lukewarm water (100° to 115°F)",
    "1 tablespoon (15 grams) olive oil",
    "2 thick or 3 thin scallions, thinly sliced",
    "2 garlic cloves, minced",
    "4 ounces (115 grams) spinach leaves (baby spinach is fine)",
    "Red pepper flakes, to taste",
    "Olive oil, about 4 to 6 tablespoons",
    "1 (14-ounce) can quartered artichoke hearts, drained and patted dry",
    "Zest and juice from half a lemon",
    "6 ounces (170 grams) mozzarella, diced or perlini",
    "1/2 cup (45 grams) grated parmesan",
    "1/2 cup (55 grams) grated fontina or asiago cheese"
  ],
  "steps": [
    "In a large bowl, whisk together the flour, salt, and yeast. Add water and olive oil, and stir until no dry pockets remain. Cover with plastic wrap and let rise until doubled and jiggly, about 1½ to 2 hours at room temperature (or refrigerate before fully doubled to finish later).",
    "Heat oven to 450°F (230°C). Coat a 12-inch cast-iron skillet or 9x13 pan with 2-3 tablespoons olive oil. Scrape dough into the pan, turn once to coat in oil, and dimple it gently toward the edges. Cover loosely and rest 30 minutes to proof.",
    "Meanwhile, make the spinach pesto: In a food processor, pulse scallions and garlic. Add spinach and pulse until chopped. Drizzle in olive oil until thick but spreadable (4–6 tablespoons). Season with salt and red pepper flakes to taste.",
    "After proofing, gently dimple the dough again out to the edges. Spread half of the spinach pesto over the dough to the edges—no border needed. Arrange artichoke hearts evenly, grate some lemon zest over, then top with mozzarella, parmesan, and fontina. Season with salt, red pepper flakes, and a bit more lemon zest.",
    "Bake 25-30 minutes, until the top is toasty and the edges are deeply golden and crisp. (Do not underbake; full time yields the best texture.)",
    "Finish with lemon juice. Serve directly from the pan or slide onto a cutting board before slicing into wedges or squares."
  ],
  "notes": [
    "Recipe adapted from a focaccia dough by Alexandra Stafford.",
    "Makes 1 pizza; pesto yields enough for 2.",
    "Leftovers reheat well at 350°F to 375°F for 15 minutes on a foil-lined pan.",
    "Spinach pesto keeps up to 5 days refrigerated.",
    "Double the dough if making two pizzas — leftovers are excellent.",
    "Crust is tender and crisp-edged; ideal for home ovens without pizza stones."
  ]
}
